Revit 2027 API
BuiltInFailures.AutoRouteFailures.NoFittingInRoutingError Property
 The fitting that is converted to was not defined. Please assign one in the routing preference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoFittingInRoutingError { get; }
Public Shared ReadOnly Property NoFittingInRoutingError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoFittingInRoutingError {
	FailureDefinitionId^ get ();
}
static member NoFittingInRoutingError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace